Repository: EakerLord/mf-angular-19
Catalog: src/i18n/messages.*.xlf
Languages: es

source: Select a lesson to see their tasks, but be aware because you have a 3% chance of a cursed guard blocking your way:
es: Selecciona una lección para ver sus tareas, pero ten cuidado porque tienes un 3% de probabilidad de que un guardia maldito bloquee tu camino:

source: Knowledge of Angular 19
es: Conocimientos de Angular 19

source: Senior-level knowledge with the Angular framework and version 19
es: Conocimientos a nivel senior del framework Angular y la versión 19

source: Loading the available places, please wait.
es: Cargando los lugares disponibles, por favor espera.

source: Unfortunately, no places could be found.
es: Lamentablemente, no se pudieron encontrar lugares.

source: Loading your favorite places, please wait.
es: Cargando tus lugares favoritos, por favor espera.

source: Close HTTP request
es: Cerrar solicitud HTTP

source: Create your personal collection of places you would like to visit or you have visited.
es: Crea tu colección personal de lugares que te gustaría visitar o que ya has visitado.

source: Add Task
es: Agregar tarea

source: Cancel
es: Cancelar

source: Create
es: Crear

source: Title
es: Título

source: Summary
es: Resumen

source: Due Date
es: Fecha de vencimiento

source: Sorry! Page not found
es: ¡Lo sentimos! Página no encontrada

source: The URL you requested could not be found.
es: No se pudo encontrar la URL solicitada.

source: Back to main page
es: Volver a la página principal

source: Invalid form - please check your input data.
es: Formulario inválido - por favor revisa tus datos ingresados.

source: Welcome on board!
es: ¡Bienvenido a bordo!

source: We just need a little bit of data from you to get you started 🚀
es: Solo necesitamos algunos datos tuyos para comenzar 🚀

source: Account Information
es: Información de la cuenta

source: Email
es: Correo electrónico

source: Password
es: Contraseña

source: Confirm Password
es: Confirmar contraseña

source: Personal Information
es: Información personal

source: First Name
es: Nombre

source: Last Name
es: Apellido

source: Your Address
es: Tu dirección

source: Street
es: Calle

source: Number
es: Número

source: Postal Code
es: Código postal

source: City
es: Ciudad

source: What best describes your role?
es: ¿Cuál describe mejor tu rol?

source: Select a role
es: Selecciona un rol

source: Student
es: Estudiante

source: Teacher
es: Profesor

source: Employee
es: Empleado

source: Founder
es: Fundador

source: Other
es: Otro

source: How did you find us?
es: ¿Cómo nos encontraste?

source: Referred by friend
es: Recomendado por un amigo

source: Reset
es: Restablecer

source: Sign up
es: Registrarse

source: Login
es: Iniciar sesión

source: Please enter a valid email.
es: Por favor, introduce un correo electrónico válido.

source: Please enter a valid password, at least 6 characters and a question mark.
es: Por favor, introduce una contraseña válida, de al menos 6 caracteres y un signo de interrogación.

source: Open
es: Abierta

source: In-Progress
es: En progreso

source: Completed
es: Completada

source: Change Status
es: Cambiar estado

source: Complete
es: Completar

source: One-way: Interpolation uses:
es: Unidireccional: La interpolación usa:

source: One-way: Property binding uses: [src]="imageUrl"
es: Unidireccional: El enlace de propiedades usa: [src]="imageUrl"

source: One-way: Event binding uses: (click)="onClick()"
es: Unidireccional: El enlace de eventos usa: (click)="onClick()"

source: Two-way: Biding uses: [(ngModel)]="username"
es: Bidireccional: El enlace usa: [(ngModel)]="username"

source: Structural directives: Modify the structure of the DOM, adding or removing elements.
es: Directivas estructurales: Modifican la estructura del DOM, agregando o eliminando elementos.

source: Attribute directives: Change the appearance or behavior of an element, such as modifying styles or attributes.
es: Directivas de atributo: Cambian la apariencia o el comportamiento de un elemento, como modificar estilos o atributos.

source: Components: These are directives with their own template, that is, they combine logic and view, and are the basis of any Angular application.
es: Componentes: Son directivas con su propia plantilla, es decir, combinan lógica y vista, y son la base de cualquier aplicación Angular.

source: Example of a structural directive called "*appAuth" and an attribute directive called "appSafeLink": <a class="task-card__summary" href="https://angular.dev/" appSafeLink="/tutorials">Link to Angular site!</a>
es: Ejemplo de una directiva estructural llamada "*appAuth" y una directiva de atributo llamada "appSafeLink": <a class="task-card__summary" href="https://angular.dev/" appSafeLink="/tutorials">¡Enlace al sitio de Angular!</a>

source: Example of the inbuild "DatePipe" and a custom pipe named "temperature" that can accept up to two configuration attributes:
es: Ejemplo del "DatePipe" incorporado y de un pipe personalizado llamado "temperature" que puede aceptar hasta dos atributos de configuración:

source: Custom pipe:
es: Pipe personalizado:

source: In build pipe:
es: Pipe incorporado:

source: Angular has an Injector that manages dependencies declared as providers. If a component or service needs another class, Angular looks for that class in the injection tree, creates it (if necessary), and delivers it.
es: Angular tiene un inyector que gestiona las dependencias declaradas como proveedores. Si un componente o servicio necesita otra clase, Angular la busca en el árbol de inyección, la crea (si es necesario) y la entrega.

source: Any class marked with the @Injectable() decorator can be a dependency.
es: Cualquier clase marcada con el decorador @Injectable() puede ser una dependencia.

source: Angular allows you to control the scope of the injected instance:
es: Angular te permite controlar el alcance de la instancia inyectada:

source: providedIn: 'root': Global singleton, available throughout the application and Only one instance.
es: providedIn: 'root': Singleton global, disponible en toda la aplicación y solo una instancia.

source: providedIn: 'platform' (Advanced): Available across the entire platform, even beyond multiple Angular apps on the same page.
es: providedIn: 'platform' (Avanzado): Disponible en toda la plataforma, incluso más allá de múltiples aplicaciones Angular en la misma página.

source: providedIn: 'any': A new instance for each lazy-loaded module and useful for isolating services between modules.
es: providedIn: 'any': Una nueva instancia para cada módulo cargado de forma diferida y útil para aislar servicios entre módulos.

source: providedIn: 'self' / SkipSelf (advanced): Controls which level of the Angular injector to resolve the dependency and used in conjunction with @Optional, @Self, @SkipSelf, etc.
es: providedIn: 'self' / SkipSelf (avanzado): Controla en qué nivel del inyector de Angular resolver la dependencia y se usa junto con @Optional, @Self, @SkipSelf, etc.

source: In addition to providedIn, Angular also allows you to declare providers in various places: @Injectable( providedIn: 'root' ), providers: [] in a component, providers: [] in a module and Injector.create()
es: Además de providedIn, Angular también permite declarar proveedores en varios lugares: @Injectable(providedIn: 'root'), providers: [] en un componente, providers: [] en un módulo e Injector.create()

source: Manual or advanced injection: Injecting custom tokens, injecting values ​​(useValue), Injecting concrete classes (useClass) and Injecting factories (useFactory)
es: Inyección manual o avanzada: Inyectar tokens personalizados, inyectar valores (useValue), inyectar clases concretas (useClass) e inyectar fábricas (useFactory)

source: Observables are values on a stream of data and are great for managing events or streamed data.
es: Los observables son valores en un flujo de datos y son ideales para gestionar eventos o datos transmitidos.

source: Signals are values on a container and are great for managing the application state.
es: Las signals son valores en un contenedor y son ideales para gestionar el estado de la aplicación.

source: This is the example of a built-in observable:
es: Este es el ejemplo de un observable incorporado:

source: This is the example of a custom observable by clicking the button:
es: Este es el ejemplo de un observable personalizado al hacer clic en el botón:

source: Click to increment the signal converted into observable!
es: Haz clic para incrementar la signal convertida en observable.

source: HTTP Requests in Angular allow your application to communicate with external servers to send or receive data, such as:
es: Las solicitudes HTTP en Angular permiten que tu aplicación se comunique con servidores externos para enviar o recibir datos, como:

source: Retrieving information from a REST API, Submitting forms, Saving data to a database, Authentication, etc.
es: Obtener información de una API REST, enviar formularios, guardar datos en una base de datos, autenticación, etc.

source: Types of HTTP Requests:
es: Tipos de solicitudes HTTP:

source: GET: Obtains data from the server. Used to read information, such as a list of users or products.
es: GET: Obtiene datos del servidor. Se utiliza para leer información, como una lista de usuarios o productos.

source: POST: Sends data to the server. Used to create new resources (for example, registering a user).
es: POST: Envía datos al servidor. Se utiliza para crear nuevos recursos (por ejemplo, registrar un usuario).

source: PUT: Completely replaces an existing resource. Used when you want to update an entire object.
es: PUT: Reemplaza completamente un recurso existente. Se utiliza cuando deseas actualizar un objeto completo.

source: PATCH: Partially updates a resource. Use it when you only want to change some fields of the object.
es: PATCH: Actualiza parcialmente un recurso. Úsalo cuando solo quieras cambiar algunos campos del objeto.

source: DELETE: Deletes a resource from the server.
es: DELETE: Elimina un recurso del servidor.

source: Click on me to learn more about HTTP requests with images!
es: Haz clic en mí para aprender más sobre solicitudes HTTP con imágenes.

source: Guards types
es: Tipos de guards

source: CanMatch: Decides whether a route can be used by the router before it is even evaluated whether it can be activated or loaded.
es: CanMatch: Decide si una ruta puede ser utilizada por el router antes de que se evalúe si puede ser activada o cargada.

source: CanActivate: Determines whether a route can be activated. This is useful for protecting routes that should only be accessible to authenticated users or those with certain permissions.
es: CanActivate: Determina si una ruta puede ser activada. Esto es útil para proteger rutas que solo deben ser accesibles para usuarios autenticados o con ciertos permisos.

source: CanDeactivate: Controls whether a user can exit a route. The most typical example is unsaved data.
es: CanDeactivate: Controla si un usuario puede salir de una ruta. El ejemplo más típico son los datos no guardados.

source: CanLoad: Prevents a lazy-loaded module from loading if certain conditions are not met.
es: CanLoad: Evita que un módulo cargado de forma diferida se cargue si no se cumplen ciertas condiciones.

source: Data types in the guards
es: Tipos de datos en los guards

source: data: Allows you to associate custom static information with a route.
es: data: Permite asociar información estática personalizada a una ruta.

source: resolve: Allows you to obtain necessary data before a route is activated. Ensures that the information is available before displaying the associated component.
es: resolve: Permite obtener los datos necesarios antes de que una ruta sea activada. Asegura que la información esté disponible antes de mostrar el componente asociado.

source: Click to show the simple form
es: Haz clic para mostrar el formulario simple

source: Click to show the complex form
es: Haz clic para mostrar el formulario complejo

source: {{ lessonName() }}'s Tasks
es: Tareas de {{ lessonName() }}

source: All
es: Todos

source: Sort {{ sortSignal() === 'asc' ? 'Descending' : 'Ascending' }}
es: Ordenar {{ sortSignal() === 'asc' ? 'Descendente' : 'Ascendente' }}

source: Okay
es: De acuerdo
